app/controllers/cabanas_controller.rb

SELECT * FROM `cabanas`
---
  def index
    @cabanas = Cabana.all

SELECT * FROM `cabanas` WHERE (`cabanas`.`id` = 1)
---
  def show
    @cabana = Cabana.find(params[:id])

INSERT INTO `cabanas` (`created_at`, `nombre`, `updated_at`, `descripcion`, `servicio_id`) VALUES('2009-09-16 15:10:59', 'Cipres', '2009-09-16 15:10:59', 'ssfsfsfsffsff', NULL)
---
  def create
    @cabana = Cabana.new(params[:cabana])

    respond_to do |format|
      if @cabana.save