app/controllers/home_controller.rb

SELECT * FROM `ubicacions`
---
  def index
    @ubicacions = Ubicacion.all

SELECT * FROM `servicios`
---
  def servicios
    @servicios = Servicio.all