app/controllers/servicios_controller.rb

SELECT * FROM `servicios`
---
  def index
    @servicios = Servicio.all